inference/inference-Leonardo/results/vllm/sharegpt/Llama-3.1-8B-Instruct/Nodes_4-GPUs_4-TP_16-PP_1/launch-1/logs_benchmarking_100-concurrency.log
INFO 09-15 15:55:46 [__init__.py:244] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='localhost', port=2950, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/benchmarks/datasets/ShareGPT_V3_unfiltered_cleaned_split.json', max_concurrency=100, model='/leonardo_scratch/large/userinternal/rscheda0/models/Llama-3.1-8B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir=None, result_filename='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/results/vllm/sharegpt/Llama-3.1-8B-Instruct/Nodes_4-GPUs_4-TP_16-PP_1/launch-1/Concurrency_100.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto')
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100
============ Serving Benchmark Result ============
Successful requests:                     997       
Benchmark duration (s):                  63.56     
Total input tokens:                      213304    
Total generated tokens:                  197663    
Request throughput (req/s):              15.69     
Output token throughput (tok/s):         3109.83   
Total Token throughput (tok/s):          6465.74   
---------------Time to First Token----------------
Mean TTFT (ms):                          70.00     
Median TTFT (ms):                        55.50     
P99 TTFT (ms):                           209.25    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          27.95     
Median TPOT (ms):                        27.84     
P99 TPOT (ms):                           33.70     
---------------Inter-token Latency----------------
Mean ITL (ms):                           27.54     
Median ITL (ms):                         27.49     
P99 ITL (ms):                            31.65     
==================================================