inference/inference-Leonardo/results/vllm/sharegpt/Llama-3.1-8B-Instruct/Nodes_4-GPUs_4-TP_16-PP_1/launch-1/logs_benchmarking_50-concurrency.log
INFO 09-15 15:53:42 [__init__.py:244] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='localhost', port=2950, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/benchmarks/datasets/ShareGPT_V3_unfiltered_cleaned_split.json', max_concurrency=50, model='/leonardo_scratch/large/userinternal/rscheda0/models/Llama-3.1-8B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir=None, result_filename='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/results/vllm/sharegpt/Llama-3.1-8B-Instruct/Nodes_4-GPUs_4-TP_16-PP_1/launch-1/Concurrency_50.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto')
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 50
============ Serving Benchmark Result ============
Successful requests:                     997       
Benchmark duration (s):                  104.33    
Total input tokens:                      213304    
Total generated tokens:                  197765    
Request throughput (req/s):              9.56      
Output token throughput (tok/s):         1895.54   
Total Token throughput (tok/s):          3940.02   
---------------Time to First Token----------------
Mean TTFT (ms):                          84.00     
Median TTFT (ms):                        62.92     
P99 TTFT (ms):                           714.06    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          25.21     
Median TPOT (ms):                        24.25     
P99 TPOT (ms):                           38.80     
---------------Inter-token Latency----------------
Mean ITL (ms):                           24.45     
Median ITL (ms):                         21.13     
P99 ITL (ms):                            62.82     
==================================================